example/example.xml

<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:sub='http://api.dcp.ericsson.net/SubscriptionTraffic'>
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand='1' xmlns:wsse='http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd' xmlns:wsu='http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd'>
            <wsse:UsernameToken>
                <wsse:Username>operator1@example.com</wsse:Username>
                <wsse:Password>********</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <sub:Query xmlns:sub='http://api.dcp.ericsson.net/SubscriptionTraffic'>
            <resource>
                <id>123456789012345 </id>
                <type>imsi</type>
            </resource>
        </sub:Query>
    </soapenv:Body>
</soapenv:Envelope>


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:apis="http://api.dcp.ericsson.net/ApiStatus">
    <soapenv:Header/>
    <soapenv:Body>
        <apis:Echo>
            <message>hello</message>
        </apis:Echo>
    </soapenv:Body>
</soapenv:Envelope>


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:quer="http://api.dcp.ericsson.net/SubscriptionTraffic">
    <soapenv:Header/>
    <soapenv:Body>
        <quer:Query>
            <resource>
                <id>123456789123456</id>
                <type>imsi</type>
            </resource>
            <range>1</range>
        </quer:Query>
    </soapenv:Body>
</soapenv:Envelope>
